<?php
//$x=10;
//$y=6;
//echo ($x + $y); // 输出16
//echo "\n";  // 换行
//
//echo ($x - $y); // 输出4
//echo "\n";  // 换行
//
//echo ($x * $y); // 输出60
//echo "\n";  // 换行
//
//echo ($x / $y); // 输出1.6666666666667
//echo "\n";  // 换行
//
//echo ($x % $y); // 输出4
//echo "\n";  // 换行
//
//echo -$x;
//
//echo "\n";  // 换行
//$x=10;
//echo $x; // 输出10
//echo "\n";  // 换行
//
//$y=20;
//$y += 100;
//echo $y; // 输出120
//echo "\n";  // 换行
//
//$z=50;
//$z -= 25;
//echo $z; // 输出25
//echo "\n";  // 换行
//
//
//$i=5;
//$i *= 6;
//echo $i; // 输出30
//echo "\n";  // 换行
//
//$j=10;
//$j /= 5;
//echo $j; // 输出2
//echo "\n";  // 换行
//
//$k=15;
//$k %= 4;
//echo $k; // 输出3
//echo "\n";  // 换行
//
//?>

<?php $x=10;  echo ++$x; // 输出11  $y=10;  echo $y++; // 输出10  $z=5; echo --$z; // 输出4  $i=5; echo $i--; // 输出5 ?>
